"use client"

import { useAppSelector } from "@/store";
import styles from "./page.module.scss";
import { NewsType } from "@/types/news";
import { formatDateNoTime } from "@/services/dates";
import DOMPurify from "isomorphic-dompurify";
import parse from 'html-react-parser';
import ArrowIcon from "../../../../public/arrow-short.svg"
import { useTranslations } from "next-intl";
import { useParams } from "next/navigation";

const news = [
  {
    "_id": "1",
    "title": "Цена токена Ripple выросла в 2025 году почти на 40%. Почему подорожал XRP",
    "content": "<h4>Криптовалюта XRP от Ripple выросла почти на 40% с начала 2025 года</h4><div>Закупки «китов» и ожидание ETF — что еще повлияло на курс криптовалюты от Ripple Labs</div><p>Курс криптовалюты XRP (XRP) от Ripple Labs вырос на 25% за неделю и почти на 40% с начала года (с $2,09 до $2,88). На фоне значительного роста цены XRP участники сообщества вспомнили, что во время цикла рынка 2017–2018 годов токен неоднократно выбивался на вторую строчку по капитализации, опережая Ethereum (ETH).</p><p>На 13:30 мск XRP торгуется по $2,83 при капитализации $162,2 млрд. Капитализация ETH — $387 млрд, однако ведущий альткоин не показывает роста. За последнюю неделю Ethereum подешевел на 4%.</p><p>В настоящий момент вокруг компании Ripple сформировалась позитивная новостная повестка. По данным аналитика ETF в Bloomberg Джеймса Сейффарта на декабрь 2024 года, в Комиссию по ценным бумагам и биржам США (SEC) были поданы уже четыре заявки на запуск биржевых фондов (ETF) на XRP. В JPMorgan прогнозируют, что притоки капитала в эти ETF могут превзойти притоки существующих Ethereum-фондов в течение полугода после запуска.</p><p>Кроме того, ончейн-аналитики отмечают рост покупок XRP «китами» рынка. В Santiment предположили, что рост цены токена может быть связан с «продолжающимся огромным накоплением» в кошельках, содержащих от 1 до 10 млн XRP. Аналитическая компания сообщила, что с 12 ноября эта группа инвесторов накопила 1,43 млрд XRP, прирост их накоплений составил около 37,4%.</p><p>Позитивный настрой инвесторов подогревает и то, что 15 января истекает срок, когда SEC может подать апелляцию в суд по делу против Ripple. Регулятор несколько лет судился с компанией, пытаясь приравнять XRP к незарегистрированным ценным бумагам, но в 2023 году суд постановил, что розничные продажи XRP нельзя рассматривать с этой позиции.</p><p>В настоящий момент Ripple обговаривают размещение собственного стейблкоина Ripple USD (RLUSD) с крупнейшими криптобиржами, включая Coinbase. Запуск токена прошел в декабре 2024 года. По данным CoinMarketCap, RLUSD уже доступен на торговых платформах Bitso, Bullish, Bitstamp, Mercado Bitcoin и Independent Reserve.</p><p>В то же время Ripple является одним из крупнейших криптовалютных спонсоров предвыборной кампании Трампа и его грядущей инаугурации. Рост XRP в начале января также подстегнула встреча СЕО Ripple Брэда Гарлингхауса и директора по правовым вопросам Стюарта Алдероти с Дональдом Трампом. Эксперты рынка отметили, что это событие стало «однозначно позитивным знаком» для XRP.</p><p>За прошедшие сутки Ripple подорожал сильнее биткоина. Еще две монеты из топ-10 по капитализации — Cardano (ADA) и Dogecoin (DOGE) — также обошли по росту первую криптовалюту.</p>",
    "date": "2025-01-15T14:14:26.000Z",
    "img": "https://s0.rbk.ru/v6_top_pics/resized/590xH/media/img/5/26/347369339015265.jpeg"
  },  
  {
    "_id": "2",
    "title": "5 важнейших криптовалютных метрик в 2025 году. За чем следит фонд a16z",
    "content": "<h4>Крупнейший венчурный криптофонд a16z выделил 5 важных метрик в 2025 году</h4><h4>Крупный криптовалютный фонд рассказал, за какими показателями крипторынка стоит наблюдать в 2025 году и почему</h4><p>2024 год вполне может войти в историю как один из самых захватывающих моментов в истории криптоиндустрии. Активность и использование криптовалют достигли рекордных максимумов. Были одобрены биржевые фонды (ETF) на биткоин и Ethereum, а нормативная среда теперь открывает позитивные перспективы для всей отрасли, считают аналитики криптовалютного подразделения крупнейшего венчурного фонда на рынке Andreessen Horowitz (a16z crypto). В новом отчете они выделили пять важных показателей, за которыми стоит наблюдать в 2025 году.</p><p>«Рассматривая будущее криптовалют, мы приводим пять показателей, за которыми будем внимательно следить, для определения дальнейшего прогресса отрасли», — отметили аналитики a16z в отчете.</p><div>Фонд Andreessen Horowitz (a16z) был основан в 2009 году Марком Андриссеном и Беном Хоровицем, его начальный капитал составлял $300 млн. По состоянию на середину 2024 года под управлением компании находилось 27 фондов, которые совокупно привлекли свыше $32 млрд. К текущему моменту количество инвестиций фонда достигло 169, а его розничный ROI (возврат инвестиций) составляет 76 902%. В частности, один из фондов компании — a16z crypto — ориентирован исключительно на инвестиции в криптопроекты.</p><p>Криптовалютное подразделение компании вкладывает средства в разработки в области игр на блокчейне, децентрализованных финансов, соцсетей, инфраструктуры масштабирования блокчейнов первого и второго уровней, мостов, децентрализованных автономных организаций (DAO) и управления, сообществ NFT и других.</div><h4>Мобильные кошельки</h4><p>Создание условий для прихода следующей волны пользователей криптовалюты потребует достижения того же пользовательского опыта, что предоставляют традиционные интернет-приложения, считают в a16z. А ключевую роль в этом направлении будут играть мобильные кошельки.</p><p>В прошлом месяце число пользователей мобильных криптокошельков достигло исторического максимума, впервые преодолев отметку в 35 млн. Этому способствовал рост приложений, включающих Coinbase Wallet, MetaMask и Trust Wallet, а также новых кошельков Phantom и World App.</p><p>По мнению экспертов, сейчас самое подходящее время для создания мобильных кошельков следующего поколения: «Мы будем внимательно следить за этими разработками в 2025 году».</p><h4>Стейблкоины</h4><p>Активность использования стейблкоинов в 2024 году выросла из-за развития блокчейн-инфраструктуры, которая позволила снизить комиссии за транзакции, говорится в отчете. Примечательно, что стейблкоины используются не только для торговли криптовалютами — теперь их применяют для трансграничных платежей и переводов, покупки товаров и услуг, а также в качестве средства сбережения, особенно в странах с высокой инфляцией.</p><p>Эксперты указали, что стейблкоины уже являются самым дешевым способом «переводить доллары» и ожидается, что в 2025 году не только розничные пользователи, но и компании будут все чаще принимать стейблкоины для своих платежей.</p><p>Партнер, , что в 2025 году ожидается волна экспериментов со стороны малого и среднего бизнеса, которые «осознают потенциал перехода на процессинг в стейблкоинах» для предприятий.</p>",
    "date": "2025-01-15T11:37:26.000Z",
    "img": "https://s0.rbk.ru/v6_top_pics/resized/590xH/media/img/0/06/347369221692060.jpeg"
  },
  {
    "_id": "3",
    "title": "Разработчики TON объявили об экспансии блокчейна в США. С чего они начали",
    "content": "<p>Компания TON Foundation, занимающаяся поддержкой блокчейна TON, объявила о планах экспансии проекта в США. Первым шагом стало назначение президентом организации Мануэля «Мэнни» Стотца, возможности которого должны помочь расширить внедрение экосистемы TON в Соединенных Штатах.</p><p>Блокчейн TON в прошлом имел неприятный опыт, связанный со взаимодействием с регуляторами США. Компания Telegram объявила о планах запустить сеть TON в начале 2018 года, потом в октябре 2019-го, однако Комиссия по ценным бумагам и биржам США (SEC) добилась судебного запрета на запуск этого проекта. В мае 2020-го Павел Дуров объявил о том, что TON в конечном счете не будет запущен из-за решения американского суда.</p><p>В то же время сторонние разработчики запустили сеть Free TON. Технически это была та же блокчейн-платформа TON, разработанная командой Telegram и ее партнерами. Но команда разработчиков утверждала, что Павел Дуров не имеет отношения к новому проекту. В 2023 году в Швейцарии была создана некоммерческая организация TON Foundation, которая стала с тех пор заниматься развитием сети TON.</p><p>На текущий момент в сети TON работают сотни приложений: криптокошельки, децентрализованные торговые площадки, магазины, инструменты для разработчиков, игры и многие другие. В 2024 году количество аккаунтов в сети TON выросло примерно с 4 млн до 130 млн.</p><p>Блокчейн по-прежнему связан с мессенджером Telegram. По мнению экспертов, успех экосистемы в прошлом году был вызван ростом популярности сети TON за счет колоссального потока новых игроков и пользователей приложений-«тапалок» из Telegram, таких как Notcoin и Hamster Kombat.</p><p>Сейчас нативная монета блокчейна Toncoin (TON) занимает 13-е место в списке крупнейших криптовалют с капитализацией в $13,6 млрд. Исторический максимум монеты был зафиксирован на уровне $8,25 в середине июня 2024 года. На 17:30 мск TON торгуется около $5,38.</p><p>Мануэль Стотц состоит в совете основателей TON Foundation с момента ее создания. Он также основал британскую инвестиционную компанию Kingsway Capital, которая управляет активами институциональных инвесторов из США на несколько миллиардов долларов, говорится в сообщении. Kingsway поддерживает более 50 проектов из блокчейн-сектора, включая Animoca Brands, Blockchain.com, CoinDCX и TON.</p><p>«Глубокое понимание Мэнни роли блокчейна в расширении экономических возможностей и истории инвестиций позволило ему создать сеть из глобальных инвесторов, организаций и успешных предпринимателей, что дало ему уникальную возможность расширить внедрение TON на рынке США», — говорится в пресс-релизе.</p><p>Стив Юн, бывший президентом до Стотца, продолжит работу в совете TON Foundation. Разработчики объявили, что ближайшие месяцы обещают TON значительный прогресс в США.</p><p>В середине сентября аналитики криптобиржи Bitget выпустили большой исследовательский отчет «Экосистема TON — ключевой источник роста крипторынка». Один из выводов отчета заключается в том, что в течение ближайших двух лет будет наблюдаться тенденция к «детелеграмизации» блокчейна TON.</p><p>Согласно отчету, «детелеграмизация» будет способствовать снижению регуляторных рисков, связанных с мессенджером. После ареста Дурова во Франции в августе показатели сети TON значительно изменились, общая заблокированная стоимость (total value locked, TVL) всех приложений в экосистеме упала с $500 млн до $350 млн примерно за две недели после задержания Дурова.</p><p>Курс Toncoin тогда резко упал на 15%. Восстановиться до прежних уровней токен смог только в конце ноября.</p>",
    "date": "2025-01-14T14:00:00.000Z",
    "img": "https://s0.rbk.ru/v6_top_pics/resized/590xH/media/img/6/72/347368675611726.jpeg"
  },  
  {
    "_id": "4",
    "title": "Криптобиржа опционов Deribit получила предложение о покупке. Цена вопроса",
    "content": "<h4>Биржа Kraken интересовалась приобретением крупнейшей платформы для торговли криптовалютными деривативами</h4><p>Крупнейшая биржа криптовалютных деривативов Deribit получила предложение о ее покупке, сообщает Bloomberg со ссылкой на неназванные источники. По информации издания, торговая площадка может быть оценена в $4–5 млрд или более.</p><p>Deribit в начале 2023 года наняла компанию Financial Technology Partners для организации вторичной продажи акций существующим инвесторам биржи, и теперь в обязанности консалтинговой компании входит также оценка заявок на всю компанию, сообщили источники журналистам. По их словам, покупкой Deribit интересовалась криптобиржа Kraken.</p><p>Kraken и FT Partners отказались от комментариев. А в Deribit сообщили, что биржа не выставлена на продажу, но вызывает интерес у различных стратегических инвесторов. Подробности платформа раскрывать отказалась.</p><p>По данным компании, общий объем торгов на Deribit, которая предлагает опционы, фьючерсы и спотовую торговлю, в прошлом году почти удвоился и составил около $1,2 трлн. За последние 24 часа объем торгов на ней составил $1,15 млрд, по данным CoinGecko.</p>",
    "date": "2025-01-14T11:02:00.000Z",
    "img": "https://s0.rbk.ru/v6_top_pics/resized/590xH/media/img/8/00/347369268387008.jpeg"
  },
  {
    "_id": "5",
    "title": "Polymarket открыл ставки на упоминание биткоина в речи Трампа. Каков шанс",
    "content": "<h4>Пользователи сервиса прогнозов оценивают вероятность того, что новый президент США будет говорить о криптовалютах на своей инаугурации</h4><p>Пользователи Polymarket делают ставки на то, упомянет ли Дональд Трамп на своей инаугурации биткоин или Dogecoin. В пуле прогнозов «Что скажет Трамп во время инаугурационной речи?» участники поставили в общей сложности $975 тыс. на то, будет ли новый президент говорить про криптовалюты.</p><p>Церемония вступления Трампа в должность президента США назначена на 20 января. В ходе нее по традиции новый глава государства должен произнести речь.</p><p>Пользователи Polymarket поставили почти $646 тыс. на то, скажет Трамп «криптовалюта» или «биткоин» или нет, а также более $329 тыс. на то, упомянет ли он DOGE или Dogecoin в своей речи.</p><p>На 12:00 мск 14 января вероятность упоминания «крипто» или «биткоин» (в одной ставке) оценивается в 19%, шансы услышать от Трампа про DOGE или Dogecoin — в 12%.</p><p>Согласно правилам, любое использование терминов независимо от контекста будет учитываться. Так, помимо криптовалютной тематики, слово DOGE — это сокращенное название нового Министерства эффективности государственного управления в США, руководить которым назначены Илон Маск и Вивек Рамасвами.</p><p>Самая высокая вероятность быть упомянутым, по мнению пользователей, у слова «Байден» — 89%, затем идут «Америка прежде всего» — 76%, «Америка» (15 или более упоминаний) — 72% и «Бог» (четыре или более упоминаний) — 66%. Также в списке есть варианты «Камала», «МакДональдс» и «Илон Маск».</p><p>Общий объем ставок в пуле прогнозов о том, что Трамп скажет в своей инаугурационной речи, на момент публикации превысил $2 млн. Таким образом, ставки на «криптовалютные» варианты составляют почти половину от этого объема.</p><p>Участники отрасли ожидают, что Трамп сразу же после вступления в должность начнет реализовывать свои предвыборные обещания о поддержке крипторынка. Однако эксперты полагают, что серьезные изменения не могут произойти быстро, на них потребуется время.</p><p>Сама же платформа Polymarket сталкивается с регуляторными проблемами. 12 января стало известно, что в Сингапуре сервис был назван незаконным провайдером азартных игр и заблокирован. Ранее его запретили в США и Франции.</p>",
    "date": "2025-01-14T11:00:00.000Z",
    "img": "https://s0.rbk.ru/v6_top_pics/resized/590xH/media/img/0/25/347368440065250.jpeg"
  },  
  {
    "_id": "6",
    "title": "Sony запустила блокчейн и начала блокировать там мемкоины. В чем причина",
    "content": "<h4>Пользователи выразили недовольство потерей доступа к токенам из-за политики разработчиков новой сети</h4><p>Запуск блокчейна Soneium от Sony 14 января сопровождался недовольством и критикой со стороны пользователей, поскольку разработчики внесли в черный список несколько мемкоинов за нарушение прав интеллектуальной собственности, пишет The Block. Ограничение операций с некоторыми токенами привело их владельцев к потере доступа к средствам в первый день работы основной сети.</p><p>Sony Block Solutions Labs, дочерняя компания транснационального конгломерата, базирующаяся в Сингапуре, объявила 14 января о запуске основной сети блокчейна Soneium. Дебют тестовой сети L2 (второго уровня) на базе Ethereum состоялся в августе 2024 года. К настоящему моменту в Soneium зарегистрировано 15,5 млн активных адресов и проведено более 50 млн транзакций.</p><p>Soneium предоставляет комплексные решения — от базовой инфраструктуры Web3 до прикладного уровня, на котором создатели контента смогут расширить свои творческие возможности и повысить вовлеченность своих фан-сообществ, говорится в пресс-релизе Sony. При этом большой акцент разработчики делают на защиту прав интеллектуальной собственности.</p><p>В черный список в первую очередь попадают токены, которые имитируют или используют брендинг, защищенный Sony или Soneium. По информации издания, пользователи, пытающиеся получить доступ к заблокированным токенам, получают предупреждение о запрете в официальном обозревателе Soneium.</p><p>Это вызвало недовольство в сообществе, участники начали сообщать в соцсети X о внезапной невозможности торговать некоторыми мемкоинами или получать к ним доступ в сети Soneium. Основатель сервиса pump.fun под псевдонимом Алон раскритиковал платформу за то, что она «активно вносит в черный список мемкоины, которые ей не нравятся, мгновенно обнуляя позиции всех [держателей этих монет]».</p>",
    "date": "2024-12-17T14:00:00.000Z",
    "img": "https://s0.rbk.ru/v6_top_pics/resized/590xH/media/img/0/25/347368440065250.jpeg"
  },  
]

// {data}: {data: NewsType}

export default function NewsDetailPage() {
  const t = useTranslations('News');
  const lang = useAppSelector((state) => state.auth.language);
  const { slug } = useParams();
  const selectedNews = news.filter((el) => el._id === slug)[0]
  const data = {...selectedNews, date: formatDateNoTime(selectedNews.date)[lang].monthName};
  // const sameData = {...dataEx, date: formatDateNoTime(dataEx.date)[lang].noTime};
  const date = data?.date.split(" ");
  const image = data?.img || "./news-example.png";
  const safeContent = DOMPurify.sanitize(data.content);
  const title = selectedNews.title.split('.');

  return (
    <div className={styles.page}>
      <div className={styles.header}>
        <div className={styles.date}>
          <div className={styles.dateDay}>
            {date[0]}
          </div>
          <div>
            <p className={styles.month}>{date[1]}</p>
            <p className={styles.year}>{date[2]}</p>
          </div>
        </div>
        <div className={styles.back}>
          <ArrowIcon className={styles.arrow}/>
          <div>
            {t("backBtn")}
          </div>
        </div>
      </div>
       <h2 className={styles.title}>{data?.title}</h2>
      {/*{*/}
      {/*  !!title.length && (*/}
      {/*    <div className={styles.titles}>*/}
      {/*      {title.map((el, index) => (*/}
      {/*        <div key={index}>*/}
      {/*          <h2>{el}.</h2>*/}
      {/*          <hr/>*/}
      {/*        </div> */}
      {/*      ))}*/}
      {/*     </div> */}
      {/*  )*/}
      {/*}*/}
      <div className={styles.image}>
        <img src={image} alt="news" />
      </div>
      <div className={styles.content}>{parse(safeContent)}</div>
      {/* <div className={styles.otherNews}>
        <Link href={`/news/${sameData._id}`} className={styles.cardSecondary}>
          <NewsSameCard data={sameData} />
        </Link>
        <Link href={`/news/${sameData._id}`} className={styles.cardSecondary}>
          <NewsSameCard data={sameData} />
        </Link>        
      </div> */}
    </div>
  );
}
